{
    "content": "Certeza que para quem utiliza a plataforma do TabNews a feature mais desejada é a barra de buscas. Enquanto não temos ela implementada podemos utilizar alguns recursos do Google para encontrar o que desejamos!\n\n## Google Hacking\n\nGoogle Hacking é uma coleção de comandos que podem ser utilizados para encontrar o que você deseja. É um termo usado para descrever a arte de explorar técnicas de pesquisa avançada, operadores e algoritmos para localizar brechas de segurança em aplicativos, redes e sistemas da web, mas pode ser utilizado para encontrar qualquer coisa na internet.\n\nUtilizamos alguns termos e characteres especiais para realizar essas buscas, seguem os principais:\n\n- **intext:** Útil para localizar páginas que contêm certos caracteres ou strings dentro de seu texto. Exemplo: intext:“TabNews”.\n\n- **filetype:** Este operador é usado para procurar por arquivos específicos. Exemplo: pdf, txt e etc...\n\n- **site:** Este operador é usado para procurar em sites específicos. Exemplo: site:tabnews.com.br\n\n- **inurl:** Este operador é usado para procurar por palavras específicas dentro de uma URL. Exemplo: inurl:“tabnews”\n\n- **allintext:** Este operador é usado para procurar por palavras específicas dentro de um documento. Exemplo: allintext:“TabNews”\n\n- **allinurl:** Pode ser usado para obter resultados cuja URL contém todos os caracteres especificados. Exemplo: allinurl:“tabnews”\n\n## Realizando buscas no TabNews\n\n### 1# Exemplo de busca: \n> JavaScript site:tabnews.com.br\n\nResultado:\n\nComo resultado da busca no Google temos diversos Links da TabNews com o assunto JavaScript.\n\n![Resultada da busca no Google com Links da TabNews com o assunto JavaScript](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ul0kfd1r8ld7km7vr6bw.png)\n\n\n### 2# Exemplo de busca: \n> Java intext:Spring Boot site:tabnews.com.br\n\nResultado:\n\nQuando adicionamos o termo ```intext:Spring Boot``` estamos dizendo para o Google que queremos encontrar o termo Spring Boot dentro do texto do site. Como resultado temos os posts do TabNews que contém o termo \"Spring Boot\".\n\n![Resultada da busca no Google com Links da TabNews com o assunto Java e também com Spring Boot em destaque](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/7opcnrt898y9gnlp988v.png)\n\n\nViu como é simples? E essa técnica funciona para qualquer site!\n\n---\nSe gostou do conteúdo, compartilhe com seus amigos e deixe seu comentário!\n\nGitHub: https://github.com/jjeanjacques10/\nMedium: https://medium.com/@jjeanjacques10\n\nAté a próxima!"
}
